FI/Koodistotiedot/Integraatiopalvelu_Koodistotiedot_Palvelukuvaus_1.0.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="CodeServiceIntegration" targetNamespace="urn:Tieto.HCW.EIS.CodeService.WCFService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="urn:Tieto.HCW.EIS.CodeService.WCFService" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.CodeService.ServiceContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:Tieto.HCW.EIS.CodeService.ServiceContracts"><xs:import namespace="urn:Tieto.HCW.EIS.CodeService.WCFService"/><xs:element name="CodeServiceRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q1:MessageHeader" xmlns:q1="urn:Tieto.HCW.EIS.CodeService.WCFService"/><xs:element minOccurs="0" ref="q2:Common" xmlns:q2="urn:Tieto.HCW.EIS.CodeService.WCFService"/><xs:element minOccurs="0" ref="q3:Code" xmlns:q3="urn:Tieto.HCW.EIS.CodeService.WCFService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetCodeServiceDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q4:AcknowledgeRequestStatus" xmlns:q4="urn:Tieto.HCW.EIS.CodeService.WCFService"/><xs:element minOccurs="0" ref="q5:MessageHeader" xmlns:q5="urn:Tieto.HCW.EIS.CodeService.WCFService"/><xs:element minOccurs="0" ref="q6:IntegrationCodeService" xmlns:q6="urn:Tieto.HCW.EIS.CodeService.WCFService"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"><xs:complexType name="MessageHeader"><xs:sequence><xs:element minOccurs="0" name="MessageID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="TransactionID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderApplication" nillable="true" type="xs:string"/><xs:element name="ReceiverID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CharacterSet" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DataServiceURL" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserLanguageCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VersionNumber" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="MessageHeader" nillable="true" type="tns:MessageHeader"/><xs:complexType name="LisCommon"><xs:sequence><xs:element minOccurs="0" name="ContractKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingSystem" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingUserId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LisCommon" nillable="true" type="tns:LisCommon"/><xs:complexType name="AcknowledgeRequestStatus"><xs:sequence><xs:element minOccurs="0" name="HasOperationFailed" type="xs:boolean"/><xs:element minOccurs="0" name="ErrorType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="AcknowledgeRequestStatus" nillable="true" type="tns:AcknowledgeRequestStatus"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.CodeService.WCFService" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts"/><xs:element name="MessageHeader" nillable="true" type="q1:MessageHeader" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Common" nillable="true" type="q2:LisCommon" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Code" nillable="true" type="q3:CodeReq" xmlns:q3="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts"/><xs:element name="AcknowledgeRequestStatus" nillable="true" type="q4:AcknowledgeRequestStatus" xmlns:q4="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="IntegrationCodeService" nillable="true" type="q5:IntegrationCodeService" xmlns:q5="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Common"/><xs:complexType name="CodeReq"><xs:sequence><xs:element name="CodeSetId" type="q1:CodeSet" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Common"/><xs:element minOccurs="0" name="BeginTime" type="xs:dateTime"/><xs:element minOccurs="0" name="EndTime" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="CodeReq" nillable="true" type="tns:CodeReq"/><xs:complexType name="IntegrationCodeService"><xs:sequence><xs:element minOccurs="0" name="Code" nillable="true" type="tns:ArrayOfCode"/></xs:sequence></xs:complexType><xs:element name="IntegrationCodeService" nillable="true" type="tns:IntegrationCodeService"/><xs:complexType name="ArrayOfCode"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Code" nillable="true" type="tns:Code"/></xs:sequence></xs:complexType><xs:element name="ArrayOfCode" nillable="true" type="tns:ArrayOfCode"/><xs:complexType name="Code"><xs:sequence><xs:element minOccurs="0" name="CodeSetName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CodeSetId" type="q2:CodeSet" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Common"/><xs:element minOccurs="0" name="CodeValue" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CodeDescription" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="StartDate" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="EndDate" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="Notes" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Notes2" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Code" nillable="true" type="tns:Code"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Common" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Common"><xs:simpleType name="CodeSet"><xs:restriction base="xs:string"><xs:enumeration value="KHPalv"/></xs:restriction></xs:simpleType><xs:element name="CodeSet" nillable="true" type="tns:CodeSet"/></xs:schema></wsdl:types><wsdl:message name="CodeServiceRequest"><wsdl:part name="parameters" element="q1:CodeServiceRequest" xmlns:q1="urn:Tieto.HCW.EIS.CodeService.ServiceContracts"/></wsdl:message><wsdl:message name="GetCodeServiceResponse"><wsdl:part name="parameters" element="q2:GetCodeServiceDataResponse" xmlns:q2="urn:Tieto.HCW.EIS.CodeService.ServiceContracts"/></wsdl:message><wsdl:portType name="ICodeService"><wsdl:operation name="GetCodeService"><wsdl:input wsaw:Action="urn:Tieto.HCW.Tieto.HCW.EIS.CodeService.WCFService.GetCodeServer" name="CodeServiceRequest" message="tns:CodeServiceRequest"/><wsdl:output wsaw:Action="urn:Tieto.HCW.EIS.CodeService.WCFService/ICodeService/GetCodeServiceResponse" name="GetCodeServiceResponse" message="tns:GetCodeServiceResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_ICodeService" type="tns:ICodeService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetCodeService"><soap:operation soapAction="urn:Tieto.HCW.Tieto.HCW.EIS.CodeService.WCFService.GetCodeServer" style="document"/><wsdl:input name="CodeServiceRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetCodeServiceResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="CodeServiceIntegration"><wsdl:port name="BasicHttpBinding_ICodeService" binding="tns:BasicHttpBinding_ICodeService"><soap:address location="http://localhost:3557/CodeServiceIntegration.svc"/></wsdl:port></wsdl:service></wsdl:definitions>