FI/Koodistotiedot/Integraatiopalvelu_Koodistotiedot_Esimerkkisanoma_CodeService_Request_1.0.txt


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.CodeService.ServiceContracts" xmlns:urn1="urn:Tieto.HCW.EIS.CodeService.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.CodeService.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:CodeServiceRequest>
         <!--Optional:-->
         <urn1:MessageHeader>
            <!--Optional:-->
            <tiet:MessageID>?</tiet:MessageID>
            <!--Optional:-->
            <tiet:TransactionID>?</tiet:TransactionID>
            <!--Optional:-->
            <tiet:SenderID>?</tiet:SenderID>
            <!--Optional:-->
            <tiet:SenderApplication>?</tiet:SenderApplication>
            <tiet:ReceiverID>?</tiet:ReceiverID>
            <!--Optional:-->
            <tiet:ReceiverApplication>?</tiet:ReceiverApplication>
            <!--Optional:-->
            <tiet:CharacterSet>?</tiet:CharacterSet>
            <!--Optional:-->
            <tiet:DataServiceURL>?</tiet:DataServiceURL>
            <!--Optional:-->
            <tiet:UserLanguageCode>?</tiet:UserLanguageCode>
            <!--Optional:-->
            <tiet:VersionNumber>?</tiet:VersionNumber>
         </urn1:MessageHeader>
         <!--Optional:-->
         <urn1:Common>
            <!--Optional:-->
            <tiet:ContractKey>4B23C19F-9A99-49AB-923E-CE0A9877BB22</tiet:ContractKey>
            <!--Optional:-->
            <tiet:UserId>?</tiet:UserId>
            <!--Optional:-->
            <tiet:CallingSystem>Koodisto</tiet:CallingSystem>
            <!--Optional:-->
            <tiet:CallingUserId>?</tiet:CallingUserId>
         </urn1:Common>
         <!--Optional:-->
         <urn1:Code>
            <tiet1:CodeSet>KHPalv</tiet1:CodeSet>
            <!--Optional:-->
            <tiet1:BeginTime>1997-01-01</tiet1:BeginTime>
            <!--Optional:-->
            <tiet1:EndTime>2014-12-31</tiet1:EndTime>
         </urn1:Code>
      </urn:CodeServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>